# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 Nano with DualSK at P2 Head

# Parameters
nc: 1 # Số lượng lớp (ví dụ: cây thông bệnh)
scales: # Bản Nano (n)
  n: [0.33, 0.25, 1024]

# 0-P1/2, 1-P2/4, 2-P3/8, 3-P4/16, 4-P5/32
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 3, C2f_DualSK, [512]] # P4: Dùng C2f_DualSK
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f_DualSK, [1024]] # P5: Dùng C2f_DualSK
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P5
  - [-1, 3, C2f, [1024]] # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
